{
  "policies": [
    {
      "displayName": "Block Copilot for High-Risk Users",
      "state": "enabled",
      "conditions": {
        "users": {
          "includeGroups": ["<high-risk-users-group-id>", "<departing-employees-group-id>"]
        },
        "applications": {
          "includeApplications": ["Microsoft 365 Copilot"]
        },
        "userRiskLevels": ["high"]
      },
      "grantControls": {
        "builtInControls": ["block"]
      }
    },
    {
      "displayName": "Require MFA for Copilot Access",
      "state": "enabled",
      "conditions": {
        "users": {
          "includeUsers": ["All"]
        },
        "applications": {
          "includeApplications": ["Microsoft 365 Copilot"]
        }
      },
      "grantControls": {
        "builtInControls": ["mfa"]
      }
    },
    {
      "displayName": "Require Compliant Device for Copilot",
      "state": "enabled",
      "conditions": {
        "users": {
          "includeUsers": ["All"]
        },
        "applications": {
          "includeApplications": ["Microsoft 365 Copilot"]
        }
      },
      "grantControls": {
        "builtInControls": ["compliantDevice"]
      }
    }
  ]
}
